<template>
  <div class="treaty-wrap" style="padding: 20px 20px 80px;">
    <div>
     为了使用过海有信平台进行借贷交易，用户（以下或称“您”）应当事先阅读并同时遵守《借款协议》（以下简称“本协议”）及您与杭州过海投资管理有限公司（以下简称“本公司”）签署的相关服务协议（包括但不限于《用户注册协议》）。<br>
    本公司依据本协议为您提供借贷交易的居间服务。
    本公司在此特别提醒您认真阅读和充分理解本协议各条款，特别是其中所涉及的免除或限制本公司责任、限制用户权利、争议解决和法律适用条款。<br>请您审慎阅读并选择是否接受本协议。<br>除非您接受本协议所有条款，否则您无权使用过海有信平台服务。<br>您一经点击已阅读并同意本协议，即视为对本协议的理解和接受，您同意本协议对本公司和您具有法律约束力。<br>如果您不同意本协议的任何内容或无法准确理解相 关条款，请不要进行后续操作。<br>
    <br><b>本协议由以下各方在签订：</b> <br>
    甲方（借款人）： <span>{{page.jfUserName}}</span>（已认证）<br>
    甲方身份证号： <span>{{page.jfIdCardNo}}</span><br>
    甲方注册手机号： <span>{{page.jfMobile}}</span><br>
    乙方（出借人）： <span>{{page.yfUserName}}</span>（已认证） <br>
    乙方身份证号： <span>{{page.yfIdCardNo}}</span><br>
    乙方注册手机号： <span>{{page.yfMobile}}</span><br>
    丙方（居间服务商）：杭州过海投资管理有限公司（“过海有信”平台的运营管理人）
    甲、乙双方均已在丙方平台注册，同意遵守丙方平台的各项行为准则，在充分阅读理解本文本情形下，本着诚信自愿原则签订本《借款协议》。<br><br><b>本协议内容如下：</b><br>
    一、借款主要内容 <br>
    借款金额：<span>{{page.loanMoney}}</span><br>
    借款日期：<span>{{page.loanDate}}</span><br>
    还款方式：<span>{{page.refundMode}}</span><br>
    还款日期：<span>{{page.refundDate}}</span><br>
    年化利率：<span>{{page.annualRate}}</span><br>
    还款总额：<span>{{page.refundTotalAmount}}</span><br>
    注：还款总额=借款金额*（1+借款时长/365）*年化利率，其中借款时长为借款日期和还款日期间的天数；此处的“借款日期”是指乙方向甲方实际支付借款且借款已到账的日期。 借款人可多次还款直至待还本息全部还清，但提前还款并不减少待还本息。<br><br>

    二、借款流程 <br>
    出借人在过海有信平台生成借条，填写或选择借款金额、年化利率、还款方式、借款时长、逾期利率、借款人手机号等基本信息，点击确定后发送至借款人。看到上述出借信息的出借人同意该出借的，可以申请此出借，经出借人审核同意，可立即进行支付，。 <br><br>
    三、补借条流程 <br>
    出借人和借款人在线下完成了借款资金的划转交割，需要通过过海有信平台完善借款手续的，双方都可以在过海有信平台起草借条，起草完成后点击发送按钮，即代表承认借条中约定的借款金额、起借日期、还款日期、年化利率等信息。
    在确认人确认该借条之前，起草人有权利将该借条删除。如果确认无误，点击确认借条按钮即代表认可借条中约定信息，确认后本协议即时生效。 <br><br>
    四、偿还方式 <br>
    1、借款人、出借人自行约定借款利率、借款时长、还款方式，本公司不介入打款、还款环节。当贷款结清后，必须在本平台上，将借条状态更改为已还款或已完成。<br>
    注意：如果甲方通过线下方式将本息偿还给了乙方，但未在过海有信平台上发起已还款提醒，则过海有信平台视为未还款，因此引起的一切后果 由甲方自行承担。<br>
    2、借款人若每月以等额本息的方式还款。计算公式如下：<br>
    第一月还款金额=本金/分期数(n)+利息/分期数(n)(≥0)+利息分期余额(≥0)；
    第二月还款金额=本金/分期数(n)+利息/分期数(n)(≥0)；
    第N月还款金额=本金/分期数(n)+利息/分期数(n)(≥0)；
    至还款完毕为止。<br>
    其中：（1）借款本金指上述第一部分列明的借款本金；<br>
    （2）利率指上述第一部分列明的借款利率，即好友双方确认的年化利率；<br>
    （3）还款月数指上述第一部分列明的还款期数；<br>
    （4）借款人每月还款金额中暂不包含“超级借条服务费用”等其他费用；<br>
    （5）上述分期数及利息由出借人与借款人自行决定。<br>
    3、过海有信有权在还款日之前向借款人发出还款提示。<br>
    4、借款人按本协议记载的借款明细约定履行还款义务。<br><br>
    五、承诺与保证 <br>
    1、出借人保证其所用于出借的资金来源合法，系出借人的自有资金，出借人是该资金的合法所有人，如果第三方对资金归属、合法性问题发生争议，由出借人自行负责解决。如出借人未能解决，则放弃享有其所出借款项所带来的利息收益。 <br>
    2、出借人承诺其拥有非保本类金融产品投资的经历并熟悉互联网。 <br>
    3、借款人承诺，不会违反中国的法律法规、将所借资金用于违规或非法用途，否则由此造成的损失全部由借款人承担。 <br><br>
    六、违约与还款能力降低 <br>
    1、借款人行为符合以下情形中任意一种的即视为违约，包括： <br>
    （1）借款人交易到期未足额偿还借款本金、利息及相应费用的；<br>
    （2）违反中国的法律法规、将所借资金用于违规或非法用途的； <br>
    （3）借款人提供虚假资料或隐瞒重要事实的。 <br>
    2、借款人行为符合以下情形中之任意一种即视为还款能力降低： <br>
    （1）在出借人以外任何第三方的其他借款、担保、赔偿、承诺或任何其他债务出现严重违约情况，影响或可能影响借款人还款能力 的；<br>
    （2）部分或者全部丧失民事行为能力、死亡、被宣告死亡或者被宣告失踪，影响或可能影响借款人还款能力的； <br>
    （3）借款人被采取刑事强制措施，影响或可能影响借款人还款能力的； <br>
    （4）借款人财产被没收、征用、查封、损坏、扣押、冻结的或借款人财产遭受重大损失，影响或可能影响借款人还款能力的；<br>
    （5）出现任何其他影响或可能影响借款人还款能力的事件。 <br>
    3、若借款人发生违约行为或者还款能力降低事件，或根据出借人/过海有信合理判断借款人可能发生本条第1款和第2款所述事件 的，出借人有权委托本公司通过互联网在线和线下各种方式向借款人进行催收，出借人与借款人一致同意本公司有权采取下列任何一项、几项或全部措施予以债权救济： <br>
    （1）立即取消全部或部分借款； <br>
    （2）宣布借款全部提前到期，借款人应立即偿还所有应付款，包括但不限于欠款本金、利息、罚息及其他各项相关费用等； <br>
    （3）解除本协议；<br>
    （4）在符合法律、法规相关规定的情况下采取适当的方式对借款人进行电话催收、上门催收、信函催收、委托第三方催收、司法诉讼催收、通过电视、报刊等媒体进行公告催收等，以及向有关部门或者单位予以通报； <br>
    （5）对借款人支付账户进行冻结、扣划等操作； <br>
    （6）对拒不归还欠款的，在过海有信平台上向所有用户披露借款人的违约信息； <br>
    （7）将借款人违约情况和个人资料提供给依法成立的个人征信机构； <br>
    （8）采取法律、法规以及本协议约定的其他救济措施。 <br>
    以上各项约定不影响出借人对借款人采取法律允许的任何催收措施及行动的权利与救济。出借人有权根据法律法规及本协议的约定向借款人 进行催收。 <br><br>
    七、违约 <br>
    甲已双方需保证其提供的信息和资料的真实性，不得提供虚假资料或隐瞒重要事实。提供虚假资料或者故意隐瞒重要事实的，构成违约，应承担违约责任；构成犯罪的，丙方将有权向相关国家机关报案，追究其刑事责任。 如果甲方没有按照约定按时、足额偿还对乙方的本金和利息，则甲方按本协议的约定承担违约责任。丙方作为信息中介，不承担对乙方 未收回本息部分的代偿责任。丙方拥有将甲方违约失信的相关信息在媒体披露的权利，并且丙方会将甲方违约信息录入过海有信平台黑名单以 供他人查阅。 <br><br>
    八、担保 <br>
    1、如果本协议所涉及的借贷交易有担保人，则适用本条款。 <br>
    2、为担保本合同项下借款人债务的履行，保证人愿意为借款人提供保证。 <br>
    3、本合同的保证方式为连带责任保证。保证债务范围包括但不限于：<br>
    1）应向出借人支付的借款本金、利息、罚息、违约金、赔偿金、实现 债权的费用（包括但不限于诉讼费用、律师费用、公证费用、执行费用等）以及因债务人违约而给本合同债权人造成的损失和其他所有应付 费用。<br>
    2）应向本公司支付的服务费、交易手续费、线上还款手续费、逾期管理费、违约金、赔偿金、实现债权的费用（包括但不限于诉讼 费用、律师费用、公证费用、执行费用等）以及因债务人违约而给本公司造成的损失和其他所有应付费用。<br>
    4、本合同的保证期间为借款成功之日，至借款人清偿完毕借款协议项下的包括但不限于保证债务范围内的所有应付款项。 <br>
    5、担保人为借款人提供担保，借款人应向担保人支付担保费。该费用于出借人向借款人支付借款时由过海有信平台直接扣留并转交担保人。借款人同意该费用支付方式。 <br>
    6、借款人未按借款协议的约定按时、足额偿还借款本金和利息时，过海有信平台会向担保人推送消息，告知借款逾期的事实同时限期担保人代替还款。担保人未能按通知要求代替还款，会对其信用记录造成影响。还款日不受法定假日或公休日的影响，还款日前必须还款。 <br>
    7、担保人在此不可撤销地授权：如其未能承担担保责任按要求代替借款人还款，本公司指定的第三方支付机构可随时将担保人支付账户的 资金划转至出借人支付账户（经丙方转付），前述划转金额以本协议项下的担保债务金额为限。出借人与借款人一致同意，自本协议生效之 日起，出借人不得免除本协议项下担保人的部分或全部责任。 <br>
    8、若主债权未受清偿，债权人在本合同约定的保证期间内要求保证人承担保证责任的，从债权人要求保证人承担保证责任之日起，保证债 务开始起算并适用诉讼时效。<br> <br>
    九、债权转让 <br>
    出借人有权将本协议项下的部分或全部债权转让给本公司（本公司根据债权情况决定是否接受）或过海有信平台上的其他注册用户，出借人委托本公司将债权转让事项通过向借款人在过海有信平台注册手机号码发送短信或平台信息推送的方式通知借款人。短信或平台信息推送，一经发出即视为已通知借款人。 <br>
    借款人同意，本公司将债权转让事项通知借款人时，可以不告知债权受让人的真实姓名，无论是否知晓债权受让人真实姓名，该债权转 让均对借款人生效。 <br>
    出借人转让债权后，本协议项下其他条款不受影响，债权受让人取代出借人享有本协议项下出借人的各项权利。 <br>
    本公司同意接受出借人的债权转让的，按下一条“催收支持”执行。 <br><br>
    十、其他<br>
    本协议经甲、乙双方通过丙方过海有信平台以网络在线点击确认的方式签订，各方点击确认后本合同生效。由于过海有信平台的业务流程， 担保人在点击确认本协议时可能出借人尚未确定，但担保人在此不可撤销地确认其仍愿意为借款人提供担保，且一旦出借人点击确认本协议，本协议同时自动生效，而且在本协议履行过程中担保人不会以确认本协议时出借人尚未确定为由免除自己的担保责任。各方委托过海有信 平台保管所有与本协议有关的书面文件或电子信息，且认可“过海有信”平台在未来发生的相关纠纷中向有关裁判机构提交该等文件信息的权利 和证明争议事实的效力。
    各方均确认，本协议的签订、生效和履行以不违反法律为前提。如果本协议中的任何一条或多条违反适用的法律，则该条将被视为无 效，但该无效条款并不影响本协议其他条款的效力。
    若甲方与丙方、乙方与丙方、或甲乙丙三方发生任何纠纷或争议，首先应友好协商解决，协商不成的，同意将纠纷或争议提交丙方住所 地有管辖权的人民法院，相关的诉讼费、律师代理费等因追索权利而发生的合理费用均由败诉方承担。
    若甲方与乙方发生任何纠纷或争议，首先应友好协商解决，协商不成的，同意将纠纷或争议提交提起诉讼一方住所地有管辖权的人民法院，相关的诉讼费、律师代理费等因追索权利而发生的合理费用均由败诉方承担。
    本协议中所使用的定义，除非另有规定，否则应适用过海有信平台释义规则，过海有信平台对本文定义享有最终解释权。 <br><br>

      <div>
          乙方（出借人）：<span>{{page.yfUserName}}</span><br>
          丙方（居间服务商）： 杭州过海投资管理有限公司 <br>
          签订日期：<span>{{page.authDate}}</span> <br>
      </div>
    </div>
  </div>
</template>
<script>
export default {
  name: 'Template',
  props: {
    page: Object
  }
}
</script>
<style lang="less">
.treaty-wrap {
  font-size: 14px;
}
</style>
